//
// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і
// більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
//
// if (friends.length>=3){
//     document.write(`<h3>це великий масив</h3>`);
// }if (friends.length<=3){
//     document.write(`<h3>це малий масив</h3>`)
// }
//

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let num=[5, 8, 10];
// if (5>8 && 8<10){
//     console.log('5')
// }else
//     if (8>5 && 8<10){
//     console.log('8');
// }else
//     console.log('10');

// - Перепишіть конструкцію if з використанням умовного оператора '?':

// let a=+prompt('write first number');
// let b=+prompt('write second number')
// // if (a + b < 4) {
// //     result = 'Мало';
// // } else {
// //     result = 'Багато';
// // }
//
// let res=(a+b<4)? 'Мало':'Багато';
// console.log(res);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// let number=+prompt('write any number');
// //
// // // if (number<=-100 && number<0){
// // //     console.log('negative number');
// // // }else if (number===0){
// // //     console.log('zero');
// // // }else if (number>=0 && number<=100){
// // // console.log('positive number');
// // // }
// //
// let num=number? number<-100?'negative number': number===0?'zero'
// console.log(num);
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//
//
//
//
//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

// let test=confirm('true or false');
// // if (test==='true'){
// //     console.log('true');
// // } else if(test==='false'){
// //     console.log('false')
// // } else
// //     console.log('false')
// let res=test? true:false
// console.log(res);
// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let answer=prompt('Яка «офіційна» назва JavaScript?');
// if (answer==='ECMAScript'){
//     console.log('right!');
// } else {
//     console.log('Не знаєте? ECMAScript!');
// }

//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let numOfAppartment=+prompt('номер якої квартири ви шукаєте?');
// if (numOfAppartment>0 && numOfAppartment<=20){
//     console.log('перший підїзд');
// } else if (numOfAppartment>21 && numOfAppartment<=48){
//     console.log('другий підїд')
// }else if (numOfAppartment>49 && numOfAppartment<=90){
//     console.log('третій підїзд');
// }
// else if (numOfAppartment>91){
//     console.log('ви вказали не правильний номер квартири!!!');
// }

//
//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let num=+prompt('введіть любу цифру');
// if (num===10){
//     console.log('true')
// }
//     else {
//         console.log('false')
//     }

//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature=prompt('яка температура на вулиці?');
// if (temperature>10 && temperature<22){
//     console.log('ми йдемо ВЧИТИСЯ')
// } else if (temperature<=10){
//     console.log('сидимо вдома і вчимося ОНЛАЙН')
// }
//
//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let play=+prompt('вводимо число');
// switch (play){
//     case 1:
//     console.log('car')
//         break;
//     case 2:
//     console.log('moto')
//         break;
//     case 3:
//         console.log('phone')
//         break;
//     case 4:
//         console.log('flovers')
//         break;
//     case 5:
//         console.log('chocolate')
//         break;
//     default:
//             console.log('you lost')
// }